Revit 2027 API
EnergyDataSettings.ExportComplexity Property
 Value determines Export Complexity when AnalysisType is RoomsOrSpaces.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public gbXMLExportComplexity ExportComplexity { get; set; }
Public Property ExportComplexity As gbXMLExportComplexity
	Get
	Set
public:
property gbXMLExportComplexity ExportComplexity {
	gbXMLExportComplexity get ();
	void set (gbXMLExportComplexity value);
}
member ExportComplexity : gbXMLExportComplexity with get, set
Property Value
gbXMLExportComplexity
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The export complexity does not fall within an appropriate range.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace